CDE-CIP-TNDISPATCHER-0700-main/server/src/test/resources/unittests/CsXmlModelParserTest-verifyCardTypeRequest.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header>
    <wsse:Security SOAP-ENV:mustUnderstand="1"
                   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:UsernameToken><wsse:Username>vaas000140</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><![CDATA[5A5yq9JfXAtmjUwebAKn]]></wsse:Password></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body>
    <tkn:requestMessages xmlns:tkn="urn:schemas-cybersource-com:transaction-data-2.3"><requestId>DRSSBRA0126_s.velauthapilli_2017-04-17T15:24:45.228__OBIUI</requestId><requestMessage><srcSystem><name>OBIUI_DRSSBRA0126</name><messageId>9435BB6F-9C24-4F32-AB1B-5A70815B949A</messageId><sysIndicator></sysIndicator></srcSystem><card><expirationMonth>07</expirationMonth><expirationYear>2020</expirationYear><cardType>V</cardType><token>9872930267475467</token></card><user><userName>s.velauthapilli</userName><userId>s.velauthapilli</userId></user><ccVerifyService run="true"/></requestMessage></tkn:requestMessages></SOAP-ENV:Body></SOAP-ENV:Envelope>
